/*
Ябълка е хвърлена от земната повърхност с начална скорост 𝑣0 𝑚/𝑠 под ъгъл 𝛼° спрямо хоризонта.
Напишете програма, която по въведени 𝑣0 и 𝛼 намира и извежда с точност 2 знака след
десетичната запетая:

1. Максималната височина (m), която ябълката ще достигне;

2. На какво разстояние (m) от точката на хвърлянето ще падне ябълката.

Забележка: Приемаме, че земното ускорение е 𝑔 = 9,81 𝑚/𝑠 2 . За по-просто игнорираме
съпротивлението на въздуха.
*/
#include<iostream>
#include<math.h>

int main()
{
    double v0, a;
    std::cin >> v0 >> a;
    double g = 9.81;
    double h = v0 * v0 * sin(2 * a * 3.14 / 180) / (2 * g);
    double s = v0 * v0 * sin(a * 3.14 / 180) * sin(a * 3.14 / 180) / g;
    std::printf("%.2f\n", h);
    std::printf("%.2f\n", s);
    return 0;
}