/*
Съобщение от 3 символа е кодирано както следва:
• най-младшите 2 бита на кода на първия символ са преместени, така че да станат най-старши;
• местата на най-старшия и най-младшия бит на кода на втория символ са разменени;
• всеки от средните 4 бита на кода на третия символ е обърнат.
Напишете програма, която въвежда 3 цели числа – кодовете след като е било приложено описаното кодиране.
Програмата да декодира съобщението и да изведе трите оригинални символа.
Пример
Вход
216 224 72
Възможен изход
cat
*/
#include <iostream>
int main(){
    char a, b, c;
    std::cin >> a >> b >> c;
    a = a >> 2;
    b = (b << 6) >> 2;
    c = (c << 4) >> 4;
    std::cout << a << b << c << std::endl;
    return 0;
}