/*
Да се напише булев израз, който да има стойност истина, 
ако посоченото условие е вярно и стойност лъжа, в противен случай:
-  цялото число n се дели или на 3 и на 5, или на 2 и на 7;
-  уравнението ax2 + bx + c = 0 има реални корени
-  точка се намира извън фигурата тип “венец” с център (0, 0) и радиуси 2 и 8
*/
#include <iostream>
int main(){
    int n;
    std::cin >> n;
    bool flag = false;
    if(n % 3 == 0 && n % 5 == 0 || n % 2 == 0 && n % 7 == 0){
        flag = true;
    }
    if(flag){
        std::cout << "True" << std::endl;
    }else{
        std::cout << "False" << std::endl;
    }
    
}